Tekla Open API Reference for Tekla Structures 2025
PluginUserInterfaceAttribute.Description Property
 The description of the plug-in user interface in inp format.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Description { get; }
Public ReadOnly Property Description As String
	Get
Property Value
Type: String
See Also
Reference
PluginUserInterfaceAttribute Class
Tekla.Structures.Plugins Namespace